Revit 2027 API
SpacingRule.Distance Property
The exact distance between layout lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Distance { get; set; }
Public Property Distance As Double
	Get
	Set
public:
property double Distance {
	double get ();
	void set (double value);
}
member Distance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the Layout property is None or FixedNumber.
Remarks
This property is only available when Layout is equal to FixedDistance, MaximumSpacing, or MinimumSpacing. Must be a positive value less than 30000'.
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace